#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//void test()
//{
//	printf("hehe\n");
//}
//int main()
//{
//	test(100);
//	return 0;
//}

//计算机中的有符号数（整形）有三种表达方法，即原码，补码和反码
//三种表达方法均有符号位和数值位两部分，符号位用“0”表示正。用“1”表示负，数值位三种表达方法不同
//原码：直接将二进制按照正负数的形式翻译成二进制就可以
//反码：将原码的符号位不变
//补码：反码加1得到
//int main()
//{
//	int a = 20;//4个字节，32个bit
//	//00000000000000000000000000010100---原码   （正数原码，反码和补码相同）
//	//00000000000000000000000000010100---反码
//	//0000 0000 0000 0000 0000 0000 0001 0100---补码
//	//00 00 00 14---十六进制
//	//高位      低位
//	int b = -10;
//	//10000000000000000000000000001010---原码
//	//11111111111111111111111111110101---反码
//	//1111 1111 1111 1111 1111 1111 1111 0110---补码
//	//0xF F F F F F F 6---十六进制
//	return 0;
//	//对于整形来说：数据存放内存中其实存放的是补码
//	//大端（存储）模式：数据的低位保存在内存的高地址中，而数据的高位，保存在内存的低地址中
//	//小端（存储）模式：数据的低位保存在内存的低地址中，而数据的高位，保存在内存的高地址中
//}
//int main()
//{
//	//写一段代码告诉我们当前机器的字节序是什么
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		return 1;
//	}
//	else
//	{
//		return 0;
//	}
//}

//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	//返回1，小端
//	//返回0，大端
//	return *p;
//}

//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//}
//int main()
//{
//	//写一段代码告诉我们当前机器的字节序是什么
//	//返回1，小端
//	//返回2，大端
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}
//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("a=%d.b=%d,c=%d\n", a, b, c);
//	return 0;
//}
//int main()
//{
//	char a = -128;
//	//100000000000000000000010000000
//	//111111111111111111111101111111
//	//111111111111111111111110000000--补码
//	//100000000
//	//（整形提升）111111111111111111111110000000-补码  因为打印无符号数，所以原码，补码，反码相同
//	printf("%u\n", a);
//	//%d-打印十进制的有符号数字
//	//%u-打印十进制的无符号数字
//	return 0;
//}
//int main()
//{
//	int i = -20;
//	//10000000 000000000 00000000 00010100
//	//11111111 111111111 11111111 11101011
//	//11111111 111111111 11111111 11101100
//	unsigned int j = 10;
//	//00000000 00000000 00000000 00001010
//
//	//11111111 11111111 11111111 11110110--结果（补码）
//	//11111111 11111111 11111111 11110101
//	//10000000 00000000 00000000 00001010--结果（原码）
//	printf("%d\n", i + j);
//	return 0;
//}
//#include<windows.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(100);
//	}
//	return 0;
//}
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}
unsigned char i = 0;
int main()
{
	for (i = 0; i <= 255; i++)
	{
		printf("Hello World!\n");
	}
	return 0;
}