#define _CRT_SECURE_NO_WARNINGS 1


//1.8-2求完数
//如果一个自然数的所有小于自身的因子之和等于该数，则称为完数。设计算法，打印1-9999之间的所有完数。


//#include<stdio.h>
//int main()
//{
//	int i = 0;
//	int j = 0;
//	for (i = 6; i < 10000; i++)
//	{
//		int sum = 0;
//		for (j = 1; j < i; j++)
//		{
//			if (i % j == 0)
//			{
//				sum += j;
//			}
//		}
//		if (sum == i)
//		{
//			printf("%d\n", i);
//		}
//	}
//	return 0;
//}



//2.预测身高
//生理卫生老师在课堂上娓娓道来：
//你能看见你未来的样子吗？显然不能。但你能预测自己成年后的身高，有公式：
//男孩成人后身高 = （父亲身高 + 母亲身高） / 2 * 1.08
//女孩成人后身高 = (父亲身高 * 0.923 + 母亲身高） / 2
//数学老师听见了，回头说：这是大样本统计拟合公式，准确性不错。
//生物老师听见了，回头说：结果不是绝对的，影响身高的因素很多，比如营养、疾病、体育锻炼、睡眠、情绪、环境因素等。
//老师们齐回头，看见同学们都正在预测自己的身高。
//毛老师见此情形，推推眼镜说：何必手算，编程又快又简单......
//约定：
//身高的单位用米表示，所以自然是会有小数的。
//男性用整数1表示，女性用整数0表示。
//预测的身高保留三位小数


//#include<stdio.h>
//int main()
//{
//	int g = 0;
//	double f = 0.0;
//	double m = 0.0;
//	scanf("%d %lf %lf", &g, &f, &m);
//	if (g == 1)
//	{
//		printf("%.3f", (f + m) / 2 * 1.08);
//	}
//	else
//	{
//		printf("%.3f", (f * 0.923 + m) / 2);
//	}
//	return 0;
//}



//3.4-2找公倍数
//打印出1-1000所有11和17的公倍数。


//#include<stdio.h>
//int main()
//{
//	int i = 0;
//	for (i = 1; i <= 1000; i++)
//	{
//		if (i % 11 == 0 && i % 17 == 0)
//		{
//			printf("%d\n", i);
//		}
//	}
//	return 0;
//}


//4.4-3水仙花数
//打印所有100至999之间的水仙花数。所谓水仙花数是指满足其各位数字立方和为该数字本身的整数，例如 153=1^3+5^3+3^3。


//#include<stdio.h>
//int main()
//{
//	int i = 0;
//	int j = 0;
//	int n = 0;
//	for (i = 1; i < 10; i++)
//	{
//		for (j = 0; j < 10; j++)
//		{
//			for (n = 0; n < 10; n++)
//			{
//				if (i * i * i + j * j * j + n * n * n == i * 100 + j * 10 + n)
//				{
//					printf("%d\n", i * 100 + j * 10 + n);
//				}
//			}
//		}
//	}
//	return 0;
//}


//5.5-1最小公倍数
//编写一函数lcm，求两个正整数的最小公倍数。


//#include<stdio.h>
//int main()
//{
//    int a, b, c, n, m;
//    scanf("%d %d", &a, &b);
//    n = a; m = b;
//    while (b)
//    {
//
//        c = a % b;
//        a = b;
//        b = c;
//
//
//    }
//    printf("%d\n", n * m / a);
//    return 0;
//}



//6.大等于n的最小完全平方数
//输出大等于n的最小的完全平方数。
//若一个数能表示成某个自然数的平方的形式，则称这个数为完全平方数
//Tips：注意数据范围


//#include <stdio.h>
//#include <math.h>
//int main()
//{
//    double n;
//    long long int root;
//    scanf("%lf", &n);
//    root = (long long int)ceil(sqrt(n));
//    printf("%lld", root * root);
//    return 0;
//}



